reports/033-haskell.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 1.189ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.191ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.184ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.43ms    3.44ms  86.21ms   99.31%
    Req/Sec     3.52k   509.19    15.89k    95.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.60ms
 90.000%    1.95ms
 99.000%    2.62ms
 99.900%   57.98ms
 99.990%   80.77ms
 99.999%   84.93ms
100.000%   86.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.087     0.000000            1         1.00
       0.486     0.100000        50034         1.11
       0.659     0.200000       100032         1.25
       0.816     0.300000       150096         1.43
       0.973     0.400000       199768         1.67
       1.143     0.500000       249928         2.00
       1.232     0.550000       274802         2.22
       1.323     0.600000       299769         2.50
       1.414     0.650000       324825         2.86
       1.507     0.700000       349588         3.33
       1.604     0.750000       374703         4.00
       1.654     0.775000       387219         4.44
       1.706     0.800000       399710         5.00
       1.761     0.825000       412206         5.71
       1.818     0.850000       424652         6.67
       1.880     0.875000       437027         8.00
       1.915     0.887500       443319         8.89
       1.952     0.900000       449546        10.00
       1.992     0.912500       455787        11.43
       2.036     0.925000       461968        13.33
       2.087     0.937500       468303        16.00
       2.115     0.943750       471349        17.78
       2.147     0.950000       474524        20.00
       2.183     0.956250       477683        22.86
       2.221     0.962500       480738        26.67
       2.269     0.968750       483915        32.00
       2.293     0.971875       485369        35.56
       2.323     0.975000       486918        40.00
       2.359     0.978125       488523        45.71
       2.403     0.981250       490086        53.33
       2.455     0.984375       491629        64.00
       2.487     0.985938       492411        71.11
       2.523     0.987500       493164        80.00
       2.573     0.989062       493949        91.43
       2.655     0.990625       494728       106.67
       2.817     0.992188       495507       128.00
       4.107     0.992969       495890       142.22
      10.583     0.993750       496280       160.00
      17.663     0.994531       496671       182.86
      24.591     0.995313       497061       213.33
      31.935     0.996094       497455       256.00
      35.839     0.996484       497646       284.44
      39.199     0.996875       497842       320.00
      43.007     0.997266       498036       365.71
      46.335     0.997656       498232       426.67
      49.375     0.998047       498428       512.00
      50.975     0.998242       498525       568.89
      52.607     0.998437       498621       640.00
      54.303     0.998633       498720       731.43
      56.191     0.998828       498817       853.33
      58.271     0.999023       498914      1024.00
      59.519     0.999121       498963      1137.78
      61.183     0.999219       499013      1280.00
      63.135     0.999316       499060      1462.86
      66.431     0.999414       499109      1706.67
      69.951     0.999512       499158      2048.00
      72.127     0.999561       499184      2275.56
      73.599     0.999609       499206      2560.00
      74.751     0.999658       499231      2925.71
      75.775     0.999707       499256      3413.33
      76.735     0.999756       499282      4096.00
      77.247     0.999780       499292      4551.11
      77.567     0.999805       499305      5120.00
      78.335     0.999829       499316      5851.43
      78.911     0.999854       499328      6826.67
      80.063     0.999878       499341      8192.00
      80.319     0.999890       499347      9102.22
      80.831     0.999902       499353     10240.00
      81.215     0.999915       499359     11702.86
      81.727     0.999927       499365     13653.33
      82.495     0.999939       499371     16384.00
      82.623     0.999945       499374     18204.44
      82.687     0.999951       499377     20480.00
      83.135     0.999957       499381     23405.71
      83.327     0.999963       499383     27306.67
      83.647     0.999969       499387     32768.00
      83.711     0.999973       499388     36408.89
      83.839     0.999976       499391     40960.00
      83.839     0.999979       499391     46811.43
      84.031     0.999982       499392     54613.33
      84.223     0.999985       499394     65536.00
      84.351     0.999986       499395     72817.78
      84.351     0.999988       499395     81920.00
      84.927     0.999989       499396     93622.86
      84.991     0.999991       499397    109226.67
      85.183     0.999992       499398    131072.00
      85.183     0.999993       499398    145635.56
      85.183     0.999994       499398    163840.00
      85.247     0.999995       499399    187245.71
      85.247     0.999995       499399    218453.33
      86.015     0.999996       499400    262144.00
      86.015     0.999997       499400    291271.11
      86.015     0.999997       499400    327680.00
      86.015     0.999997       499400    374491.43
      86.015     0.999998       499400    436906.67
      86.271     0.999998       499401    524288.00
      86.271     1.000000       499401          inf
#[Mean    =        1.429, StdDeviation   =        3.437]
#[Max     =       86.208, Total count    =       499401]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599697 requests in 1.00m, 68.06MB read
Requests/sec:   9994.77
Transfer/sec:      1.13MB