reports/033-haskell.txt
Running 1m test @ http://localhost:8080
  3 threads and 33 connections
  Thread calibration: mean lat.: 1.260ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.253ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.260ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.41ms    2.12ms  63.01ms   99.52%
    Req/Sec     3.51k   408.22    15.11k    92.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.74ms
 90.000%    2.15ms
 99.000%    2.82ms
 99.900%   42.53ms
 99.990%   58.78ms
 99.999%   61.79ms
100.000%   63.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.079     0.000000            1         1.00
       0.545     0.100000        50163         1.11
       0.726     0.200000       100050         1.25
       0.886     0.300000       149862         1.43
       1.049     0.400000       199919         1.67
       1.226     0.500000       249720         2.00
       1.323     0.550000       274801         2.22
       1.422     0.600000       299638         2.50
       1.525     0.650000       324731         2.86
       1.630     0.700000       349675         3.33
       1.742     0.750000       374738         4.00
       1.800     0.775000       387193         4.44
       1.861     0.800000       399657         5.00
       1.925     0.825000       412044         5.71
       1.995     0.850000       424577         6.67
       2.071     0.875000       437262         8.00
       2.111     0.887500       443422         8.89
       2.155     0.900000       449695        10.00
       2.201     0.912500       455815        11.43
       2.253     0.925000       462003        13.33
       2.311     0.937500       468244        16.00
       2.343     0.943750       471395        17.78
       2.377     0.950000       474486        20.00
       2.417     0.956250       477654        22.86
       2.461     0.962500       480739        26.67
       2.511     0.968750       483842        32.00
       2.539     0.971875       485393        35.56
       2.571     0.975000       486928        40.00
       2.605     0.978125       488488        45.71
       2.647     0.981250       490080        53.33
       2.693     0.984375       491657        64.00
       2.721     0.985938       492418        71.11
       2.753     0.987500       493179        80.00
       2.791     0.989062       493966        91.43
       2.841     0.990625       494724       106.67
       2.907     0.992188       495500       128.00
       2.955     0.992969       495889       142.22
       3.021     0.993750       496275       160.00
       3.133     0.994531       496669       182.86
       3.809     0.995313       497055       213.33
       9.535     0.996094       497445       256.00
      12.719     0.996484       497640       284.44
      15.447     0.996875       497835       320.00
      18.127     0.997266       498030       365.71
      21.183     0.997656       498225       426.67
      25.423     0.998047       498420       512.00
      28.543     0.998242       498518       568.89
      32.463     0.998437       498615       640.00
      35.743     0.998633       498713       731.43
      39.583     0.998828       498812       853.33
      42.911     0.999023       498908      1024.00
      44.831     0.999121       498957      1137.78
      46.687     0.999219       499006      1280.00
      48.447     0.999316       499055      1462.86
      50.143     0.999414       499103      1706.67
      51.903     0.999512       499153      2048.00
      52.703     0.999561       499176      2275.56
      53.727     0.999609       499200      2560.00
      54.527     0.999658       499225      2925.71
      55.519     0.999707       499249      3413.33
      56.319     0.999756       499275      4096.00
      56.703     0.999780       499287      4551.11
      57.151     0.999805       499298      5120.00
      57.567     0.999829       499310      5851.43
      58.239     0.999854       499323      6826.67
      58.527     0.999878       499336      8192.00
      58.687     0.999890       499342      9102.22
      58.911     0.999902       499347     10240.00
      59.327     0.999915       499353     11702.86
      59.711     0.999927       499359     13653.33
      60.031     0.999939       499366     16384.00
      60.095     0.999945       499369     18204.44
      60.159     0.999951       499372     20480.00
      60.447     0.999957       499374     23405.71
      60.543     0.999963       499377     27306.67
      60.895     0.999969       499380     32768.00
      61.023     0.999973       499382     36408.89
      61.087     0.999976       499383     40960.00
      61.183     0.999979       499385     46811.43
      61.311     0.999982       499386     54613.33
      61.375     0.999985       499388     65536.00
      61.599     0.999986       499389     72817.78
      61.599     0.999988       499389     81920.00
      61.791     0.999989       499390     93622.86
      61.951     0.999991       499391    109226.67
      62.463     0.999992       499392    131072.00
      62.463     0.999993       499392    145635.56
      62.463     0.999994       499392    163840.00
      62.687     0.999995       499393    187245.71
      62.687     0.999995       499393    218453.33
      63.007     0.999996       499394    262144.00
      63.007     0.999997       499394    291271.11
      63.007     0.999997       499394    327680.00
      63.007     0.999997       499394    374491.43
      63.007     0.999998       499394    436906.67
      63.039     0.999998       499395    524288.00
      63.039     1.000000       499395          inf
#[Mean    =        1.407, StdDeviation   =        2.120]
#[Max     =       63.008, Total count    =       499395]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599688 requests in 1.00m, 68.06MB read
Requests/sec:   9994.84
Transfer/sec:      1.13MB